In [8]:
import pandas as pd

# 시리즈 클래스

> Series = value + index

- numpy.ndarray 와 비슷하지만, 각 데이터의 의미를 표시하는 index를 붙일 수 있다.
- 데이터 자체는 value 라고 한다.

## 시리즈 생성

In [10]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],index = ['서울', '부산', '인천', '대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [14]:
s.index, s.values

(Index(['서울', '부산', '인천', '대구'], dtype='object'),
 array([9904312, 3448737, 2890451, 2466052]))

In [15]:
s.name = '인구'
s.index.name = '도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [16]:
s / (10 ** 6)

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

## 시리즈 인덱싱

In [11]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [17]:
s[1], s['부산']

(3448737, 3448737)

In [18]:
s[0:2]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [20]:
s['서울':'인천']

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [21]:
seq = [0, 3, 1]
s[seq]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [23]:
s[(250e4 < s) & (s < 500e4)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [24]:
s0 = pd.Series(range(3), index = ['a', 'b', '씨'])
s0

a    0
b    1
씨    2
dtype: int64

In [25]:
s0.a

0

In [26]:
s0.b

1

In [27]:
s0.씨

2

## 시리즈와 딕셔너리

- 파이썬 3.7 이후로, 딕셔너리에서의 원소의 순서가 보장된다.

In [28]:
'서울' in s

True

In [29]:
'대구' in s

True

In [30]:
'일산' in s

False

In [31]:
for k, v in s.items():
    print('%s = %d' % (k, v))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

In [32]:
s2 = pd.Series({'서울' : 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [34]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [37]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [36]:
s.values - s2.values

array([272830,  55546, 258416, 975894])

In [38]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [39]:
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [40]:
rs['부산'] = 1.23456
rs

부산    1.234560
서울    2.832690
인천    9.818107
dtype: float64

In [42]:
rs['일산'] = 3.45
rs

부산    1.234560
서울    2.832690
인천    9.818107
일산    3.450000
dtype: float64

In [43]:
del rs['일산']
rs

부산    1.234560
서울    2.832690
인천    9.818107
dtype: float64

In [46]:
aa = pd.Series([5, 4, 3, 2, 1], index = ['a', 'b', 'd', 'f', 'z'])
bb = pd.Series([4, 3, 6, 7, 1], index = ('a', 'b', 'c' , 'd', 'e'))
aa, bb

(a    5
 b    4
 d    3
 f    2
 z    1
 dtype: int64,
 a    4
 b    3
 c    6
 d    7
 e    1
 dtype: int64)

In [47]:
aa + bb

a     9.0
b     7.0
c     NaN
d    10.0
e     NaN
f     NaN
z     NaN
dtype: float64

In [48]:
aa - bb

a    1.0
b    1.0
c    NaN
d   -4.0
e    NaN
f    NaN
z    NaN
dtype: float64

# 데이터프레임 클래스 : Dictionary of column series

In [49]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

In [50]:
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]

In [52]:
df = pd.DataFrame(data, index = index, columns= columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [53]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [55]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [56]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [57]:
df.index.name = '도시'
df.columns.name = '특성'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [58]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

## 컬럼 데이터의 CUD

In [60]:
# "2010-2015 증가율"이라는 이름의 열 변경
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [61]:
# "2005-2010 증가율"이라는 이름의 열 추가
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [62]:
# "2010-2015 증가율"이라는 이름의 열 삭제
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

## Column Indexing

- 문자열 라벨의 열은 정수, 정수 슬라이스 형태의 인덱싱으로 참조할 수 없다.
- 정수 슬라이스 인덱싱은 Row Indexing에서 쓰인다.
- 단, 정수 라벨의 경우에는 정수 인덱싱을 사용할 수 있다.

In [63]:
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [68]:
df[['지역']]

특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [67]:
df[['2010', '2005']] / 10

특성      2010      2005
도시
서울  963148.2  976254.6
부산  339319.1  351254.7
인천  263203.5  251768.0
대구  243177.4  245601.6

In [69]:
type(df[['2005']])

pandas.core.frame.DataFrame

In [70]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [71]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int64

In [72]:
df2[[1, 2]]

   1   2
0  1   2
1  5   6
2  9  10

# Row Indexing

- 항상 슬라이싱을 이용한 인덱싱으로 행을 조회한다.

In [73]:
df[:1]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [74]:
df[1:]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [77]:
df['서울' : '인천']

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54

In [82]:
df['2015']['서울']

9904312

In [83]:
df['서울']['2015']

KeyError: '서울'

In [85]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [90]:
# 모든 학생의 수학점수
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [91]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [96]:
df['각 과목 평균 점수'] = (df['국어'] + df['수학'] + df['영어']) / 3
df

    국어  영어  수학  각 과목 평균 점수
춘향  80  90  90   86.666667
몽룡  90  70  60   73.333333
향단  70  60  80   70.000000
방자  30  80  70   60.000000

In [97]:
df['영어']['방자'] = 80
df

/var/folders/lr/jj1kxjwn315g3cjyb46358l80000gn/T/ipykernel_29088/605583398.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] = 80

    국어  영어  수학  각 과목 평균 점수
춘향  80  90  90   86.666667
몽룡  90  70  60   73.333333
향단  70  60  80   70.000000
방자  30  80  70   60.000000

In [98]:
df[:'춘향']

    국어  영어  수학  각 과목 평균 점수
춘향  80  90  90   86.666667

In [113]:
df.T['향단']

국어            70.0
영어            60.0
수학            80.0
각 과목 평균 점수    70.0
Name: 향단, dtype: float64